[
        {
            "ID": "1",
            "Traits": "Ability to learn",
            "Definition": "Learning ability is about how you learn, apply and consume knowledge to apply. There’s a whole series of courses on learning to learn, to teach yourself how you learn, how to learn, and why you are not learning something."
        },
        {
            "ID": "2",
            "Traits": "Accountability",
            "Definition": "the obligation of an individual or organization to account for its activities, accept responsibility for them, and disclose the results in a transparent manner.” It's simple: to be accountable to a team, a person needs to be clear about what they plan to do"
        },
        {
            "ID": "3",
            "Traits": "Accuracy",
            "Definition": "In a set of measurements, accuracy is closeness of the measurements to a specific value, while precision is the closeness of the measurements to each other."
        },
        {
            "ID": "4",
            "Traits": "Acting innovatively",
            "Definition": "An innovation is an idea that has been transformed into practical reality. For a business, this is a product, process, or business concept, or combinations that have been activated in the marketplace and produce new profits and growth for the organization."
        },
        {
            "ID": "5",
            "Traits": "Adaptability",
            "Definition": "Adaptability is a feature of a system or of a process. This word has been put to use as a specialised term in different disciplines and in business operations. Word definitions of adaptability as a specialised term differ little from dictionary definitions."
        },
        {
            "ID": "6",
            "Traits": "Ambition",
            "Definition": "It stands for “Confidently Passionate Personality” and it means to use your personality with a level of passion and confidence that allows the customer to believe you are genuinely interested in them and their success. It is a critical idea which is very useful in helping you gain sales over competition."
        },
        {
            "ID": "7",
            "Traits": "Analytical skills",
            "Definition": "Analytical skill is the ability to deconstruct information into smaller categories in order to draw conclusions. Analytical skill consists of categories that include logical reasoning, critical thinking, communication, research, data analysis and creativity"
        },
        {
            "ID": "8",
            "Traits": "Anticipating",
            "Definition": "The definition of anticipate is to be happy and excited about something upcoming. An example of anticipate is the feeling a woman gets as she looks forward to her wedding day. ... Anticipate is defined as to act in advance, usually as an effort to stay ahead of someone else."
        },
        {
            "ID": "9",
            "Traits": "Assertiveness",
            "Definition": "Assertiveness is the quality of being self-assured and confident without being aggressive. In the field of psychology and psychotherapy, it is a skill that can be learned and a mode of communication"
        },
        {
            "ID": "10",
            "Traits": "Attention to detail",
            "Definition": "Achieves thoroughness and accuracy when accomplishing a task through concern for all the areas involved. Behavioral Indicators. − Provides accurate, consistent numbers on all paperwork."
        },
        {
            "ID": "11",
            "Traits": "Coaching",
            "Definition": "coaching is a formal process that involves ongoing, individualized teaching on the part of sales managers to improve rep performance. Rather than a manager telling their team what to do, sales coaching includes: Guiding sellers to discover how to achieve their objectives."
        },
        {
            "ID": "12",
            "Traits": "Communication skills (verbal)",
            "Definition": "Verbal communication is the use of words to share information with other people. It can therefore include both spoken and written communication. ... The verbal element of communication is all about the words that you choose, and how they are heard and interpreted. This page focuses on spoken communication."
        },
        {
            "ID": "13",
            "Traits": "Communication skills (written)",
            "Definition": "Written communication skills are those necessary to get your point across in writing. ... Where verbal communication uses body language and tone of voice to express meaning and tone, written communication relies on grammar, punctuation and word choice."
        },
        {
            "ID": "14",
            "Traits": "Conceptual thinking",
            "Definition": "Conceptual thinking is the practice of connecting abstract, disparate ideas to deepen understanding, create new ideas and reflect on past decisions. Conceptual thinkers can understand abstract concepts, like the function of a complicated business or a nonlinear digital process, easily."
        },
        {
            "ID": "15",
            "Traits": "Conflict Resolution",
            "Definition": "It is important to manage this conflict because unresolved conflict can affect relationships between people and groups of people. "
        },
        {
            "ID": "16",
            "Traits": "Confronting",
            "Definition": "to face, meet, or deal with a difficult situation or person: As she left the court, she was confronted by angry crowds who tried to block her way. It's an issue we'll have to confront at some point, no matter how unpleasant it is."
        },
        {
            "ID": "17",
            "Traits": "Cooperation",
            "Definition": "Cooperation is the process of groups of organisms working or acting together for common, mutual, or some underlying benefit, as opposed to working in competition for selfish benefit."
        },
        {
            "ID": "18",
            "Traits": "Courage",
            "Definition": "Courage is the choice and willingness to confront agony, pain, danger, uncertainty, or intimidation. Valour is courage or bravery, especially in battle."
        },
        {
            "ID": "19",
            "Traits": "Creative thinking",
            "Definition": "Creative thinking might mean devising new ways to carry out tasks, solve problems, and meet challenges. It means bringing a fresh, and sometimes unorthodox, perspective to your work. ... Creativity thinking isn't limited to artistic types. Creative thinking is a skill that anyone can nurture and develop."
        },
        {
            "ID": "20",
            "Traits": "Critical thinking",
            "Definition": "Critical thinking is that mode of thinking — about any subject, content, or problem — in which the thinker improves the quality of his or her thinking by skillfully analyzing, assessing, and reconstructing it. Critical thinking is self-directed, self-disciplined, self-monitored, and self-corrective thinking."
        },
        {
            "ID": "21",
            "Traits": "Customer-oriented",
            "Definition": "Customer orientation is defined as an approach to sales and customer-relations in which staff focus on helping customers to meet their long-term needs and wants. Here, management and employees align their individual and team objectives around satisfying and retaining customers."
        },
        {
            "ID": "22",
            "Traits": "Decisiveness",
            "Definition": "Decisiveness means coming to a firm conclusion quickly and effectively. As simple as that definition is, there is immense power in decision-making."
        },
        {
            "ID": "23",
            "Traits": "Delegating",
            "Definition": "In a work setting, delegation typically means the transfer of responsibility for a task from a manager to a subordinate. The decision to delegate is usually made by the manager. However, sometimes an employee will volunteer to take on an expanded role."
        },
        {
            "ID": "24",
            "Traits": "Determination",
            "Definition": "Determination is a positive emotional feeling that involves persevering towards a difficult goal in spite of obstacles. Determination occurs prior to goal attainment and serves to motivate behavior that will help achieve one's goal."
        },
        {
            "ID": "25",
            "Traits": "Discipline",
            "Definition": "As a salesperson, we are told that self-discipline is a key skill to practice if we are going to be successful. So, we can now see that self-discipline means to teach ourselves, to learn about something ourselves, to be a proactive student of progress. ... Make plans now to discipline yourself."
        },
        {
            "ID": "26",
            "Traits": "Emotional Intelligence",
            "Definition": "the capacity to be aware of, control, and express one’s emotions, and to handle interpersonal relationships judiciously and empathetically"
        },
        {
            "ID": "27",
            "Traits": "Energy",
            "Definition": "Energy = motivation: Energy is the secret to everything. You can be a person of great integrity, character and all these other wonderful things, but if you don't really put your shoulder to the wheel, so to speak, and start pushing, you're not going to get to first base."
        },
        {
            "ID": "28",
            "Traits": "Entrepreneurship",
            "Definition": "An entrepreneur creates a product or service and is able to bring the product or service to market."
        },
        {
            "ID": "29",
            "Traits": "Financial awareness",
            "Definition": "Financial Awareness is a section that is present in most of the banking competitive exams. ... Anyone planning to take up employment in the banking sector must be aware of many of the terms policies and other such important information associated with financial awareness."
        },
        {
            "ID": "30",
            "Traits": "Flexibility",
            "Definition": "Flexibility is a personality trait that describes the extent to which a person can cope with changes in circumstances and think about problems and tasks in novel, creative ways. This trait is used when stressors or unexpected events occur, requiring a person to change their stance, outlook, or commitment."
        },
        {
            "ID": "31",
            "Traits": "Group-oriented leadership",
            "Definition": "Being team-oriented (or people-oriented) means working well with others and take charge when a project comes around. It's about focusing on soft skills instead of job-related skills. This contradicts task-oriented leadership. Being task-oriented generally focuses on tasks completed."
        },
        {
            "ID": "32",
            "Traits": "Impression",
            "Definition": "Impression is defined as to leave an imprint on something or to influence something or someone. An example of impression is the mark you make when you press your finger into clay. An example of impression is when someone who meets you continues to talk on and on about you"
        },
        {
            "ID": "33",
            "Traits": "Inclusiveness",
            "Definition": "inclusiveness is an aura or environment of letting people in and making them feel welcome. An example of inclusiveness is when you make your home a comfortable place for all of your friends, family, guests and people you meet. "
        },
        {
            "ID": "34",
            "Traits": "Independence",
            "Definition": "Independence is a condition of a person, nation, country, or state in which its residents and population, or some portion thereof, exercise self-government, and usually sovereignty, over its territory. The opposite of independence is the status of a dependent territory."
        },
        {
            "ID": "35",
            "Traits": "Independent learning",
            "Definition": "Independent learning is a method or learning process where learners have ownership and control of their learning – they learn by their own actions and direct, regulate, and assess their own learning."
        },
        {
            "ID": "36",
            "Traits": "Integrity",
            "Definition": "Sales integrity is often measured on the sincerity of your commitment to the customer. What you want is the customer to say yes. To spend money. But the only way you're going to do that is by ensuring what you're selling is what they need. Be honest with them."
        },
        {
            "ID": "37",
            "Traits": "Interviewing",
            "Definition": "The collection of data by asking people questions and following up or probing their answers."
        },
        {
            "ID": "38",
            "Traits": "Judgement",
            "Definition": "Developing and using contacts made in business for purposes beyond the reason for the initial contact. For example, a sales representative may ask a customer for names of others who may be interested in his product. The ability to network is one of the most crucial skills any entrepreneur can have."
        },
        {
            "ID": "39",
            "Traits": "Leadership",
            "Definition": "Leadership is the art of motivating a group of people to act toward achieving a common goal. In a business setting, this can mean directing workers and colleagues with a strategy to meet the company's needs. Here's what you need to know about leadership, and some examples of how it can benefit businesses."
        },
        {
            "ID": "40",
            "Traits": "Listening",
            "Definition": "Listening is receiving language through the ears. Listening involves identifying the sounds of speech and processing them into words and sentences. ... Listening in any language requires focus and attention. It is a skill that some people need to work at harder than others."
        },
        {
            "ID": "41",
            "Traits": "Loyalty",
            "Definition": "Customer loyalty is a measure of a customer's likeliness to do repeat business with a company or brand. It is the result of customer satisfaction, positive customer experiences, and the overall value of the goods or services a customer receives from a business."
        },
        {
            "ID": "42",
            "Traits": "Managing conflict",
            "Definition": "Conflict management is the process of limiting the negative aspects of conflict while increasing the positive aspects of conflict. The aim of conflict management is to enhance learning and group outcomes, including effectiveness or performance in an organizational setting."
        },
        {
            "ID": "43",
            "Traits": "Monitoring progress",
            "Definition": "Monitoring is simply the process of checking what has been done or spent in line with plans and budgets."
        },
        {
            "ID": "44",
            "Traits": "Motivating",
            "Definition": "Motivation is the process that initiates, guides, and maintains goal-oriented behaviors. ... Motivation involves the biological, emotional, social, and cognitive forces that activate behavior. In everyday usage, the term \"motivation\" is frequently used to describe why a person does something."
        },
        {
            "ID": "45",
            "Traits": "Negotiating",
            "Definition": "A negotiation is a strategic discussion that resolves an issue in a way that both parties find acceptable. In a negotiation, each party tries to persuade the other to agree with his or her point of view. By negotiating, all involved parties try to avoid arguing but agree to reach some form of compromise."
        },
        {
            "ID": "46",
            "Traits": "Networking",
            "Definition": "Developing and using contacts made in business for purposes beyond the reason for the initial contact. For example, a sales representative may ask a customer for names of others who may be interested in his product. The ability to network is one of the most crucial skills any entrepreneur can have."
        },
        {
            "ID": "47",
            "Traits": "occupational knowledge",
            "Definition": "Occupational knowledge has been defined as the accuracy one has in understanding information related to careers when one has this accurate understanding, he or she is considered to be informed."
        },
        {
            "ID": "48",
            "Traits": "Organisational sensitivity",
            "Definition": "Showing awareness of the consequences of one's choices, decisions and actions for parts of or the entire organization. knows how organization functions. is aware what goes on in the work environment. is able to look beyond the team or department."
        },
        {
            "ID": "49",
            "Traits": "Organising",
            "Definition": "the functions are carefully planned and coordinated towards the objective of putting the product in the hands of the consumers, where each and every effort is carefully managed to see that the functions are carried out as desired."
        },
        {
            "ID": "50",
            "Traits": "People-driven management",
            "Definition": "A people-oriented management style tends to energize employees because it makes them feel appreciated for the work they do. One of the biggest benefits of people-oriented management is that the focus on employee relationships makes employees feel that they make a difference in the company."
        },
        {
            "ID": "51",
            "Traits": "Perseverance",
            "Definition": "Perseverance is being resolute in purpose until you achieve your desired outcome. The ability to persevere is what allows one person to continue in their pursuit of an idea or a goal for as long as it takes for that goal to be achieved."
        },
        {
            "ID": "52",
            "Traits": "Persuasiveness",
            "Definition": "the quality of being able to make you want to do or believe a particular thing: His rage can diminish the persuasiveness of his argument. You have met this young woman and been impressed by her gentle strength and calm persuasiveness."
        },
        {
            "ID": "53",
            "Traits": "Planning and organising",
            "Definition": "Utilizing logical, systematic and orderly procedures to meet objectives. Those who are skilled at this competency can visualize the steps needed to reach a goal and naturally organize the process, modifying as necessary."
        },
        {
            "ID": "54",
            "Traits": "Presenting",
            "Definition": "A presentation conveys information from a speaker to an audience. Presentations are typically demonstrations, introduction, lecture, or speech meant to inform, persuade,inspire, motivate, build goodwill, or present a new idea/product."
        },
        {
            "ID": "55",
            "Traits": "Problem analysis",
            "Definition": "an approach to selling in which the salesperson works with the buyer to evaluate alternative solutions to a problem and to select the best; a consultative approach intended to build long-term relationships with clients. Also called Depth Selling."
        },
        {
            "ID": "56",
            "Traits": "Quality Focus",
            "Definition": "Setting high quality standards and striving for continuous improvement and quality assurance"
        },
        {
            "ID": "57",
            "Traits": "Responding flexibly",
            "Definition": "Flexibility is the range of motion in a joint or group of joints or the ability to move joints effectively through a complete range of motion. Flexibility training includes stretching exercises to lengthen the muscles and may include activities like yoga or Tai Chi."
        },
        {
            "ID": "58",
            "Traits": "Responding sensitively",
            "Definition": "Responding sensitively to an older child requires parents to maintain a close connection through play and quality interactions. At every stage of a child's life, parents who respond with sensitivity approach behavior by looking at the needs and wants underlying the behavior."
        },
        {
            "ID": "59",
            "Traits": "Results-oriented way of working",
            "Definition": "Result oriented is a term used to describe an individual or organization that focuses on outcome rather than process used to produce a product or deliver a service. • As such, a number of processes are used where the most effective and economical process is identified."
        },
        {
            "ID": "60",
            "Traits": "Self-development",
            "Definition": "Self-Development is a process of consciously improving oneself in various aspects of his or her life. It is the conscious pursuit of personal growth by improving personal skills, competencies, talents, and knowledge."
        },
        {
            "ID": "61",
            "Traits": "Self-knowledge",
            "Definition": "Self-knowledge is a component of the self or, more accurately, the self-concept. It is the knowledge of oneself and one's properties and the desire to seek such knowledge that guide the development of the self-concept, even if that concept is flawed."
        },
        {
            "ID": "62",
            "Traits": "Showing initiative",
            "Definition": "When you show initiative, you do things without being told; you find out what you need to know; you keep going when things get tough; and you spot and take advantage of opportunities that others pass by. You act, instead of reacting, at work. Most of us have seen initiative in action."
        },
        {
            "ID": "63",
            "Traits": "Situational awareness",
            "Definition": "Situational awareness is defined as knowing what is going on around you. ... To be aware means to be in touch with your environment – and to react to any cues given."
        },
        {
            "ID": "64",
            "Traits": "Sociability",
            "Definition": "In this context sociability describes how people interact with each other via social media such as: discussion boards, blogs, microblogs, social networking environments (e.g., Facebook, Myspace, Linkedin), and user-contributed content sites (e.g., Flickr, Youtube, Wikipedia), and many others."
        },
        {
            "ID": "65",
            "Traits": "Stress resistance",
            "Definition": "Sales resistance is the customer's normal way of weighing a product's value. ... Excuses can be expressed early in the sales process or after all the selling points have been made and may be indications of a customer's hidden objections. Objections are the opposite of excuses."
        },
        {
            "ID": "66",
            "Traits": "Tactical behaviour",
            "Definition": "A sales tactic is any action you take to put your sales strategy into action. It is how you deliver your message to consumers. For example, creating business brochures or a website and generating leads are tactics. Whereas strategy explains your purpose, tactics show the process you use to move forward."
        },
        {
            "ID": "67",
            "Traits": "Team Focus",
            "Definition": "Being team-oriented (or people-oriented) means working well with others and take charge when a project comes around. It's about focusing on soft skills instead of job-related skills. ... Instead, being team-oriented focuses on the motivations, goals, and well-being of individuals."
        },
        {
            "ID": "68",
            "Traits": "Understanding of the environment",
            "Definition": "The environment consists of the air, water, land, and all the conditions that surround living organisms. It is important to note that all the systems in the environment are interrelated such as the interactions of animals and humans on the ecosystems."
        },
        {
            "ID": "69",
            "Traits": "Vision",
            "Definition": "the sense by which the qualities of an object (as color) that make up its appearance are perceived through a process in which light rays entering the eye are transformed into signals that pass to the brain."
        }
]
